Приложение/Documents/СтартИгры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СтартИгры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиБонусов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиРейтинга</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйКапитал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Приложение/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Группы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Никнейм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Приложение/CommonForms/ФормаРегистрации/Ext/Form/Module.bsl
&НаКлиенте
Процедура Зарегистрироваться(Команда) 
	//очистка предыдущих сообщений о незаполненных полях
	ОчиститьСообщения();
	Если ПустаяСтрока(ЭтотОбъект.Email) Тогда
		Сообщить("Вы не ввели email!");
		Возврат;
	КонецЕсли;  
	Если ПустаяСтрока(ЭтотОбъект.Группа) Тогда
		Сообщить("Вы не ввели группу!");
		Возврат;
	КонецЕсли;  
	Если ПустаяСтрока(ЭтотОбъект.Никнейм) Тогда
		Сообщить("Вы не ввели никнейм!");
		Возврат;
	КонецЕсли;    
	Если ПустаяСтрока(ЭтотОбъект.Фамилия) Тогда
		Сообщить("Вы не ввели фамилию!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Имя) Тогда
		Сообщить("Вы не ввели имя!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.НомерТелефона) Тогда
		Сообщить("Вы не ввели номер телефона!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Пароль) Тогда
		Сообщить("Вы не ввели пароль!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.ПовторПароль) Тогда
		Сообщить("Вы не подтвердили пароль!");
		Возврат;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ПовторПароль=ЭтотОбъект.Пароль Тогда
		Сообщить("Пароли не совпадают");
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьсяНаСервере();
    ЗавершитьРаботуСистемы(,Истина, "/N" + ЭтотОбъект.Никнейм);
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьсяНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйСтудент = СоздатьСтудентаНаСервере();
	
	НачислитьНачальныйБюджетСтудента(НовыйСтудент);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Функция СоздатьСтудентаНаСервере()
	
	НовыйСтудентПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйСтудентПользователь.Имя = ЭтотОбъект.Никнейм;
	НовыйСтудентПользователь.ПолноеИмя = ЭтотОбъект.Фамилия +" "+ЭтотОбъект.Имя+" "+ЭтотОбъект.Отчество;
	НовыйСтудентПользователь.АдресЭлектроннойПочты = ЭтотОбъект.Email;
	НовыйСтудентПользователь.Пароль = ЭтотОбъект.Пароль;
	НовыйСтудентПользователь.ПоказыватьВСпискеВыбора = Ложь;
	
	НовыйСтудентПользователь.Роли.Добавить(Метаданные.Роли.Студент);
	НовыйСтудентПользователь.Записать();
	
	НовыйСтудентЭлемент = Справочники.Студенты.СоздатьЭлемент();
	НовыйСтудентЭлемент.Владелец = ЭтотОбъект.Группа;
	НовыйСтудентЭлемент.Имя = ЭтотОбъект.Имя;
	НовыйСтудентЭлемент.Фамилия = ЭтотОбъект.Фамилия;
	НовыйСтудентЭлемент.Отчество = ЭтотОбъект.Отчество;
	НовыйСтудентЭлемент.Телефон = ЭтотОбъект.НомерТелефона;
	НовыйСтудентЭлемент.ДатаРождения = ЭтотОбъект.ДатаРождения;
	НовыйСтудентЭлемент.Наименование =  ЭтотОбъект.Фамилия +" "+ Лев(ЭтотОбъект.Имя,1)+"."+Лев(ЭтотОбъект.Отчество,1)+".";
	
	
	
	возврат	НовыйСтудентЭлемент.Ссылка;
КонецФункции // ()

&НаСервере
Процедура НачислитьНачальныйБюджетСтудента(ИгрокСсылка)
	
	 СтартИгры = Документы.СтартИгры.СоздатьДокумент();
	 СтартИгры.Дата = ТекущаяДата();
	 СтартИгры.Студент = ИгрокСсылка;
	 СтартИгры.НачальныйКапитал = 50;
	
КонецПроцедуры
